{
  "name": "beauty_club_lead",
  "version": 1,
  "defaults": {
    "delayMs": { "min": 2000, "max": 5000 },
    "jitterMs": { "min": 0, "max": 250 }
  },
  "variables": {
    "client_name": { "required": false },
    "my_name": { "required": true },
    "my_role": { "required": true },
    "location_type": { "required": true, "enum": ["метро", "района", "города", "улицы"] },
    "location_value": { "required": true }
  },
  "steps": [
    {
      "id": "step1_contact",
      "on": "start",
      "messages": [
        "{{client_name}} здравствуйте!)",
        "Я {{my_name}}, {{my_role}} руководителя сети салонов в Москве (я не по работе)",
        "Очень понравились фотографии — представленные работы ваши?"
      ],
      "expect": {
        "type": "yes_no",
        "yes": "step2_warmup"
      }
    },
    {
      "id": "step2_warmup",
      "messages": [
        "Отлично!)",
        "По поводу того зачем пишу. Мы сейчас на бесплатной основе развиваем клуб бьюти-мастеров разных направлений для взаимного обмена клиентами.",
        "По крайней мере сейчас для новых это бесплатно (так как нам нужны кейсы где приходят новые клиенты к мастерам в нашей системе).",
        "Уже сейчас мы даем нашим мастерам: возможность меняться клиентами, премиальные карты лояльности, личный сайт, брендинг, узнаваемость, эксклюзив на территорию, размещение на картах, доступ в закрытое сообщество.",
        "В открытом же, 10+ тысяч человек у нас + закрытые мероприятия в Москве.",
        "Инструментов много и они дают клиентов без траты времени и вложений денег.",
        "Результаты мастеров по нашей системе можем показать (мы сами на Павелецкой в Москве. Мастера частники в сообществе нашем по всему СНГ. Ко встрече открыты, хоть оффлайн, хоть онлайн).",
        "Сейчас привлечение новых клиентов часто работает лучше, если вы упакованы и через рекомендации по системе лояльности, а также взаимному обмену, чем платная реклама.",
        "Если интересно, могу рассказать :)"
      ],
      "expect": {
        "type": "yes_no",
        "yes": "step3_get_tg"
      }
    },
    {
      "id": "step3_get_tg",
      "messages": [
        "Информацию готовы отправить, у нас все прозрачно и на вопросы после изучения готовы ответить.",
        "У нас сейчас 72%+ заполняемость клиентами у мастеров в 4-х салонах (а также у мастеров частников кто работает с нами и находится в клубе).",
        "Можете направить ваш ник / номер в телеграм, для отправки информации о нас, где расписано конкретно что и как работает, чтобы вы смогли точно все понять (а то здесь не дает ссылки отправлять и есть лимиты на сообщения).",
        "Направьте пожалуйста ваш телеграм.)"
      ],
      "expect": {
        "type": "free_text",
        "next": "done"
      }
    },
    {
      "id": "done",
      "messages": [
        "Здравствуйте!) Я по поводу сообщества обмена клиентами в бьюти. Отправляю всё как и договорились. Готовы привлекать вам клиентов.",
        "ССЫЛКИ НЕ АКТИВНЫ: напишите в ответ, либо нажмите крестик справа сверху или добавьте номер в контакт — и будут активны."
      ]
    }
  ]
}
